Revit 2026 API

# ArcLengthDimensionCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ArcLengthDimension Create(
	Document document,
	View dbView,
	Arc arc,
	Reference ArcRef,
	IList<Reference> references
)
```
```vb
Public Shared Function Create (
	document As Document,
	dbView As View,
	arc As Arc,
	ArcRef As Reference,
	references As IList(Of Reference)
) As ArcLengthDimension
```
```cpp
public:
static ArcLengthDimension^ Create(
	Document^ document,
	View^ dbView,
	Arc^ arc,
	Reference^ ArcRef,
	IList<Reference^>^ references
)
```
```fsharp
static member Create :
        document : Document *
        dbView : View *
        arc : Arc *
        ArcRef : Reference *
        references : IList<Reference> -> ArcLengthDimension
```

#### Parameters

document Document

dbView View

arc Arc

ArcRef Reference

references IListReference

#### Return Value

ArcLengthDimension

#### Reference

ArcLengthDimension Class

Autodesk.Revit.DB Namespace